Autodesk.Revit.DB.FormArray
An array that contains form objects.

Autodesk.Revit.DB.FormArray.Insert(Autodesk.Revit.DB.Element,System.Int32)
System.Int32
Insert the specified form into the array.
item: The form to be inserted into the array.
index: The form will be inserted before this index.
Returns: Returns whether the form was inserted into the array.

Autodesk.Revit.DB.FormArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.FormArray.ReverseIterator
Autodesk.Revit.DB.FormArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.FormArray.ForwardIterator
Autodesk.Revit.DB.FormArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.FormArray.Append(Autodesk.Revit.DB.Element)
void
Add the form to the end of the array.
item: The form to be added.

Autodesk.Revit.DB.FormArray.Clear
void
Removes every form from the array, rendering it empty.

Autodesk.Revit.DB.FormArray.Size
System.Int32
get
Returns the number of forms that are in the array.

Autodesk.Revit.DB.FormArray.Item(System.Int32)
Autodesk.Revit.DB.Element
Gets or sets a form at a specified index within the array.
index: The index of the form to be set or retrieved.
Returns: Returns the form at the specified index.

Autodesk.Revit.DB.FormArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.